lwj19872002/C13AnalyzerBootLoader_STM32/src/common/src/znFAT.c
/*
 * znFAT.c
 *
 *  Created on: 2013-4-7
 *      Author: WLD-LuoWenjie
 */

#include "inttypes.h"
#include "znFAT.h"
//#include "ss_sdcard.h"     //存储设备的扇区读写驱动，这里是SD卡
//#include "ch375.h"	   //存储设备的扇区读写驱动，这里是U盘
//#include "cf.h"
#include "string.h"

#include "stm32f30x.h"
#include "common.h"
#include "pal.h"
#include "sensor.h"
#include "global.h"
#include "controls.h"

/*******************************************************

        +-----------------------------------------+
        |振南电子 原创程序模块 znFAT文件系统 5.18 |
        +-----------------------------------------+

  此源码版权属 振南 全权享有，如欲引用，敬请署名并告知
        严禁随意用于商业目的，违者必究，后果自负
         振南电子
             ->产品网站 http://www.znmcu.cn/
             ->产品网店 http://shop.znmcu.cn/
             ->产品咨询 QQ:987582714
			            MSN:yzn07@126.com
	                    WW:yzn07
说明：znFAT经多方测试，确保其正确性与稳定性，请放心使用，
      如有bug敬请告知，谢谢！！
********************************************************/

//全局变量定义
static struct znFAT_direntry g_stTempRec;
static int8_t g_ai8TempDirName[13];
static uint32_t g_u32TempDirCluster;
static uint32_t g_u32TempLastCluster;

static uint8_t g_au8SectorBuffer[512]; //扇区数据读写缓冲区,由外部提供


//extern struct znFAT_Init_Arg *pArg; //初始化参数结构体指针，用以指向某一存储设备的初始化参数结构体，由外部提供
//extern uint8_t g_u8DeviceNo;//设备号，外部变量


static struct znFAT_Init_Arg g_stznFATInitArg;
static struct znFAT_Init_Arg *pArg = &g_stznFATInitArg; //初始化参数结构体指针，用以指向某一存储设备的初始化参数结构体
static uint8_t g_u8DeviceNo = ZNFAT_SDCARD;//设备号


/******************************************************************
 - 功能描述：znFAT的存储设备初始化函数
 - 隶属模块：znFAT文件系统模块
 - 函数属性：外部（用于对存储设备进行初始化）
 - 参数说明：无
 - 返回说明：无
 - 注：在调znFAT其它函数之前，必须先对存储设备进行成功的初始化。
 ******************************************************************/

void znFAT_Device_Init()
{
	switch(g_u8DeviceNo)	//由Dev_No来决定所使用的存储设备驱动
	{
	case ZNFAT_SDCARD:
		// SD_Reset();
		// SD_Init();
		SS_SDInit(&g_cstSDCardCfg);
		break;
	case ZNFAT_UDISK:

		break;
	case ZNFAT_CFCARD:

		break;
	case ZNFAT_OTHER:

		break;
	default:
		break;
	}
}

/******************************************************************
 - 功能描述：znFAT的存储设备底层驱动接口，读取存储设备的addr扇区的
             512个字节的数据放入buf数据缓冲区中
 - 隶属模块：znFAT文件系统模块
 - 函数属性：内部（用于与存储设备的底层驱动对接）
 - 参数说明：addr:扇区地址
             buf:指向数据缓冲区的指针
 - 返回说明：0表示读取扇区成功，否则失败
 - 注：这里加入了天狼星精华板上的三种存储设备，即SD卡（有效）、U盘、
       CF卡通过在程序中动态的切换不同的设备驱动，从而实现多设备(即同
	   时对多种存储设备进行操作，比如从SD卡拷贝文件到U盘等等)，不同
	   驱动的切换，只需要在程序中改变Dev_No这个全局变量的值即可
 ******************************************************************/

uint8_t znFAT_ReadSector(uint32_t addr,uint8_t *buf)
{
	switch(g_u8DeviceNo)	//由Dev_No来决定所使用的存储设备驱动
	{
	case ZNFAT_SDCARD:
		return SS_SDBlockRead(buf, addr);
//		return SD_Read_Sector(addr,buf);
		break;
	case ZNFAT_UDISK:
		//return CH375_Read_Sector(addr,buf);
		break;
	case ZNFAT_CFCARD:
		//return CF_Read_Sector(addr,buf);
		break;
	case ZNFAT_OTHER:
		//return XXX_Read_Sector(addr,buf);
		break;
	default:
		return 1;
	}

	return 1;
}

/******************************************************************
 - 功能描述：znFAT的存储设备底层驱动接口，将buf数据缓冲区中的512个
             字节的数据写入到存储设备的addr扇区中
 - 隶属模块：znFAT文件系统模块
 - 函数属性：内部（用于与存储设备的底层驱动对接）
 - 参数说明：addr:扇区地址
          buf:指向数据缓冲区
 - 返回说明：0表示读取扇区成功，否则失败
 - 注：略
 ******************************************************************/

uint8_t znFAT_WriteSector(uint32_t addr,uint8_t *buf)
{
	switch(g_u8DeviceNo)	//由Dev_No来决定所使用的存储设备驱动
	{
	case ZNFAT_SDCARD:
//		return SD_Write_Sector(addr,buf);
		return SS_SDBlockWrite(buf, addr);
		break;
	case ZNFAT_UDISK:
		//return CH375_Write_Sector(addr,buf);
		break;
	case ZNFAT_CFCARD:
		//return CF_WriteSector(addr,buf);
		break;
	case ZNFAT_OTHER:
		//return XXX_Write_Sector(addr,buf);
		break;
	default:
		return 1;
	}

	return 1;
}

/******************************************************************
 - 功能描述：小端转大端，即LittleEndian车BigEndian
 - 隶属模块：znFAT文件系统模块
 - 函数属性：内部
 - 参数说明：dat:指向要转为大端的字节序列
             len:要转为大端的字节序列长度
 - 返回说明：转为大端模式后，字节序列所表达的数据
 - 注：比如：小端模式的       0x33 0x22 0x11 0x00  (低字节在前)
             转为大端模式后为 0x00 0x11 0x22 0x33  (高字节在前)
             所表达的数值为   0x00112233
             (CISC的CPU通常是小端的，所以znFAT也设计为小端，而单片机
              这种RISC的CPU，通常来说都是大端的，所以需要这个函数将字
              节的存放次序进行调整，才能得到正确的数值)
 ******************************************************************/

uint32_t LE2BE(uint8_t *dat,uint8_t len)
{
	uint32_t temp=0;
	uint32_t fact=1;
	uint8_t  i=0;

	for(i=0;i<len;i++)
	{
		temp+=dat[i]*fact; //将各字节乘以相应的权值后累加
		fact*=256; //更新权值
	}
	return temp;
}

//-----------------------------------

/**************************************************************************
 - 功能描述：清空某个簇的所有扇区，填充0
 - 隶属模块：znFAT文件系统模块
 - 函数属性：内部
 - 参数说明：cluster:要清空的簇的簇号
 - 返回说明：无
 **************************************************************************/
#ifdef ZNFAT_EMPTY_CLUSTER

void znFAT_Empty_Cluster(uint32_t Cluster)
{
	uint32_t iSec;
	uint16_t i;
	for(i=0;i<pArg->BytesPerSector;i++)
	{
		g_au8SectorBuffer[i]=0;
	}
	for(iSec=ZNFAT_SOC(Cluster);iSec<ZNFAT_SOC(Cluster)+pArg->SectorsPerClust;iSec++)
	{
		znFAT_WriteSector(iSec,g_au8SectorBuffer);
	}
}

#endif
/***********************************************************************
 - 功能描述：获取剩余容量
 - 隶属模块：znFAT文件系统模块
 - 函数属性：外部，使用户使用
 - 参数说明：无
 - 返回说明：剩余容量，单位字节
 - 注：从FSInfo中读取空闲簇数，而从计算得到剩余的容量，单位字节
 ***********************************************************************/
#ifdef znFAT_GET_REMAIN_CAP

uint32_t znFAT_Get_Remain_Cap(void)
{
	znFAT_ReadSector(1+pArg->BPB_Sector_No,g_au8SectorBuffer);

	if(((struct znFAT_FSInfo *)g_au8SectorBuffer)->Free_Cluster[0]==0xff
	&& ((struct znFAT_FSInfo *)g_au8SectorBuffer)->Free_Cluster[1]==0xff
	&& ((struct znFAT_FSInfo *)g_au8SectorBuffer)->Free_Cluster[2]==0xff
	&& ((struct znFAT_FSInfo *)g_au8SectorBuffer)->Free_Cluster[3]==0xff)
	{
		return pArg->Total_Size;
	}
	else
	{
		return LE2BE(((struct znFAT_FSInfo *)g_au8SectorBuffer)->Free_Cluster,4)*pArg->SectorsPerClust*pArg->BytesPerSector;
	}
}

#endif

//--------------------------------------------

/******************************************************************
 - 功能描述：将小字字符转为大写
 - 隶属模块：znFAT文件系统模块
 - 函数属性：内部
 - 参数说明：c:要转换为大写的字符
 - 返回说明：要转换的字节的相应的大写字符
 - 注：只对小写字符有效，如果不是a~z的小写字符，将直接返回
 ******************************************************************/

int8_t L2U(int8_t c)
{
	if(c>='a' && c<='z')
		return c+'A'-'a';
	else
		return c;
}

/***********************************************************************
 - 功能描述：得到DBR所在的扇区号(如果没有MBR，则DBR就在0扇区)
 - 隶属模块：znFAT文件系统模块
 - 函数属性：内部
 - 参数说明：无
 - 返回说明：DBR的扇区地址
 - 注：DBR中包含了很多有用的参数信息，因此正确定位DBR扇区的位置，是极为
       重要的，后面将有专门的函数对DBR进行解析，正确解析DBR是实现znFAT的
       基础
 ***********************************************************************/

uint16_t znFAT_Find_DBR(void)
{
	uint16_t sec_dbr;

	znFAT_ReadSector(0,g_au8SectorBuffer);
	if(g_au8SectorBuffer[0]!=0xeb)
	{
		sec_dbr=LE2BE(((((struct znFAT_PartSector *)(g_au8SectorBuffer))->Part[0]).StartLBA),4);
	}
	else
	{
		sec_dbr=0;
	}

	return sec_dbr;
}

/***********************************************************************
 - 功能描述：获取分区的总容量
 - 隶属模块：znFAT文件系统模块
 - 函数属性：外部，使用户使用
 - 参数说明：无
 - 返回说明：分区容量值，单位为字节
 - 注：这里得到的总容量是znFAT分区的容量，一定小于实际的物理容量
 ***********************************************************************/
#ifdef ZNFAT_GET_TOTAL_SIZE

uint32_t znFAT_Get_Total_Size(void)
{
	return pArg->Total_Size;
}

#endif
/***********************************************************************
 - 功能描述：读取FSInfo获取最近的一个可用空闲簇
 - 隶属模块：znFAT文件系统模块
 - 函数属性：内部
 - 参数说明：无
 - 返回说明：最近的一个可用空闲簇
 - 注：znFAT中的FSInfo扇区(绝对1扇区)中记录了最近的一个可用空闲簇
 ***********************************************************************/

uint32_t Search_Last_Usable_Cluster(void)
{
	znFAT_ReadSector(1+pArg->BPB_Sector_No,g_au8SectorBuffer);
	return LE2BE(((struct znFAT_FSInfo *)g_au8SectorBuffer)->Last_Cluster,4);
}

/***********************************************************************
 - 功能描述：znFAT文件系统初始化
 - 隶属模块：znFAT文件系统模块
 - 函数属性：外部，使用户使用
 - 参数说明：znFAT_Init_Arg类型的结构体指针，用于装载一些重要的参数信息，
             以备后面使用
 - 返回说明：无
 - 注：在使用znFAT前，这个函数是必须先被调用的，将很多参数信息装入到
       arg指向的结构体中，比如扇区大小、根目录的位置、FAT表大小等等。
       这些参数绝大部分是来自于DBR的BPB中，因此此函数主要在作对DBR的参数解析
 ***********************************************************************/

void znFAT_Init(void)
{
	struct znFAT_BPB *bpb;

