lwj19872002/C13AnalyzerBootLoader_STM32/src/common/src/znFAT.c
	bpb=(struct znFAT_BPB *)(g_au8SectorBuffer);               //将数据缓冲区指针转为struct znFAT_BPB 型指针

	pArg->DEV_No=g_u8DeviceNo; //装入设备号

	pArg->BPB_Sector_No   =znFAT_Find_DBR();               //znFAT_FindBPB()可以返回BPB所在的扇区号

	znFAT_ReadSector(pArg->BPB_Sector_No,g_au8SectorBuffer);

	pArg->FATsectors      =LE2BE((bpb->BPB_FATSz32)    ,4);//装入FAT表占用的扇区数到FATsectors中
	pArg->FirstDirClust   =LE2BE((bpb->BPB_RootClus)   ,4);//装入根目录簇号到FirstDirClust中
	pArg->BytesPerSector  =LE2BE((bpb->BPB_BytesPerSec),2);//装入每扇区字节数到BytesPerSector中
	pArg->SectorsPerClust =LE2BE((bpb->BPB_SecPerClus) ,1);//装入每簇扇区数到SectorsPerClust 中
	pArg->FirstFATSector  =LE2BE((bpb->BPB_RsvdSecCnt) ,2)+pArg->BPB_Sector_No;//装入第一个FAT表扇区号到FirstFATSector 中
	pArg->FirstDirSector  =(pArg->FirstFATSector)+(bpb->BPB_NumFATs[0])*(pArg->FATsectors); //装入第一个目录扇区到FirstDirSector中

	pArg->Total_Size      =LE2BE((bpb->BPB_TotSec32),4)*pArg->BytesPerSector;         //磁盘的总容量，单位是字节

	g_u32TempLastCluster=Search_Last_Usable_Cluster();
}

/***********************************************************************
 - 功能描述：更新FSInfo中的可用空闲簇的数量
 - 隶属模块：znFAT文件系统模块
 - 函数属性：内部
 - 参数说明：PlusOrMinus:可用空闲簇数加1或减1
 - 返回说明：无
 - 注：创建文件、追加数据、删除文件等操作都可能会使可用的空闲簇数变化
       要及时更新
 ***********************************************************************/
#ifdef ZNFAT_UPDATE_FSINFO_FREE_CLU

void znFAT_Update_FSInfo_Free_Clu(uint32_t PlusOrMinus)
{
	uint32_t Free_Clu=0;
	znFAT_ReadSector(1+pArg->BPB_Sector_No,g_au8SectorBuffer);

	Free_Clu=(znFAT_Get_Remain_Cap())/(pArg->SectorsPerClust*pArg->BytesPerSector);

	if(PlusOrMinus)
		Free_Clu++;
	else
		Free_Clu--;

	((struct znFAT_FSInfo *)g_au8SectorBuffer)->Free_Cluster[0]=Free_Clu&0x000000ff;//((uint8_t *)&Free_Clu)[0];
	((struct znFAT_FSInfo *)g_au8SectorBuffer)->Free_Cluster[1]=(Free_Clu&0x0000ff00)>>8;//((uint8_t *)&Free_Clu)[1];
	((struct znFAT_FSInfo *)g_au8SectorBuffer)->Free_Cluster[2]=(Free_Clu&0x00ff0000)>>16;//((uint8_t *)&Free_Clu)[2];
	((struct znFAT_FSInfo *)g_au8SectorBuffer)->Free_Cluster[3]=(Free_Clu&0xff000000)>>24;//((uint8_t *)&Free_Clu)[3];
	znFAT_WriteSector(1+pArg->BPB_Sector_No,g_au8SectorBuffer);
}

#endif
/***********************************************************************
 - 功能描述：更新FSInfo中的下一个可用空闲簇的簇号
 - 隶属模块：znFAT文件系统模块
 - 函数属性：内部
 - 参数说明：Last_Clu:将要更新到FSInfo中的下一个可用空闲簇的簇号
 - 返回说明：无
 - 注：FSInfo中的下一个可用空闲簇号可以给文件系统一个参考，直接告诉文件系统
       下一个可用的空闲簇在什么地方
 ***********************************************************************/
#ifdef ZNFAT_UPDATE_FSINFO_LAST_CLU

void znFAT_Update_FSInfo_Last_Clu(uint32_t Last_Clu)
{
	znFAT_ReadSector(1+pArg->BPB_Sector_No,g_au8SectorBuffer);
	((struct znFAT_FSInfo *)g_au8SectorBuffer)->Last_Cluster[0]=Last_Clu&0x000000ff;//((uint8_t *)&Last_Clu)[0];
	((struct znFAT_FSInfo *)g_au8SectorBuffer)->Last_Cluster[1]=(Last_Clu&0x0000ff00)>>8;//((uint8_t *)&Last_Clu)[1];
	((struct znFAT_FSInfo *)g_au8SectorBuffer)->Last_Cluster[2]=(Last_Clu&0x00ff0000)>>16;//((uint8_t *)&Last_Clu)[2];
	((struct znFAT_FSInfo *)g_au8SectorBuffer)->Last_Cluster[3]=(Last_Clu&0xff000000)>>24;//((uint8_t *)&Last_Clu)[3];
	znFAT_WriteSector(1+pArg->BPB_Sector_No,g_au8SectorBuffer);
}

#endif
/***********************************************************************
 - 功能描述：获得下一个簇的簇号
 - 隶属模块：znFAT文件系统模块
 - 函数属性：内部
 - 参数说明：LastCluster:基准簇号
 - 返回说明：LastClutster的下一簇的簇号
 - 注：获得下一簇的簇号，就是凭借FAT表中所记录的簇链关系来实现的
 ***********************************************************************/
#ifdef ZNFAT_GETNEXTCLUSTER

uint32_t znFAT_GetNextCluster(uint32_t LastCluster)
{
	uint32_t temp;
	struct znFAT_FAT *pFAT;
	struct znFAT_FAT_Item *pFAT_Item;

	temp=((LastCluster/128)+pArg->FirstFATSector);
	znFAT_ReadSector(temp,g_au8SectorBuffer);
	pFAT=(struct znFAT_FAT *)g_au8SectorBuffer;
	pFAT_Item=&((pFAT->Items)[LastCluster%128]);

	return LE2BE((uint8_t *)pFAT_Item,4);
}

#endif
/***********************************************************************
 - 功能描述：比较目录名
 - 隶属模块：znFAT文件系统模块
 - 函数属性：内部
 - 参数说明：a:指向目录名1的指针
             b:指向目录名2的指针
 - 返回说明：如果两个目录名相同就返回1，否则为0
 ***********************************************************************/
#ifdef COMPARE_DIR_NAME

uint8_t Compare_Dir_Name(CONST int8_t *a,CONST int8_t *b)
{
	uint8_t i;

	for(i=0;i<8;i++)
	{
		if(a[i]!=b[i])
			return 0;
	}

	return 1;
}

#endif
/***********************************************************************
 - 功能描述：文件名匹配(支持带*?通配符的文件名的匹配)
 - 隶属模块：znFAT文件系统模块
 - 函数属性：内部
 - 参数说明：pat:源文件名，可以含*或?通配符 如 *.txt 或 A?.mp3等等
             name:目标文件名
 - 返回说明：如果两个文件名匹配就返回1，否则为0
 - 注：关于通配文件名匹配，有这样的例子，比如 A*.txt 与 ABC.txt是匹配的
   同时与 ABCDE.txt也是匹配的。此功能在文件枚举中将会用到，用来匹配
   文件名符合一定条件的文件
 ***********************************************************************/
#ifdef FILENAMEMATCH

uint8_t FilenameMatch(int8_t *pat,int8_t *name)
{
	uint8_t match,ndone;
	int8_t *cpp,*cpn;

	cpp=pat;
	cpn=name;
	match=1;
	ndone=1;
	while(ndone)
	{
		switch (*cpp)
		{
		case '*':
			cpp++;
			cpn=(int8_t *)strchr((const char *)cpn,*cpp);
			if(cpn==NULL)
			{
				cpn=name;
				while(*cpn) cpn++;
			}
			break;
		case '?':
			cpp++;
			cpn++;
			break;
		case 0:
			if(*cpn!=0)
				match=0;
			ndone=0;
			break;
		default:
			if((*cpp)==(*cpn))
			{
				cpp++;
				cpn++;
			}
			else
			{
				match=0;
				ndone=0;
			}
			break;
		}
	}
	return(match);
}

#endif
/***********************************************************************
 - 功能描述：znFAT的文件目录项的文件名字段(8个字节)，转为普通的文件名
             如：ABC     MP3 将转为 ABC.MP3
 - 隶属模块：znFAT文件系统模块
 - 函数属性：内部
 - 参数说明：dName：指向文件目录项的文件名字段的指针
             pName：指向转换完成后的文件名
 - 返回说明：无
 - 注：此函数配合上面的FilenameMatch函数，就可以实现对文件名通配匹配
 ***********************************************************************/
#ifdef ZNFAT_TOFILENAME

void znFAT_toFileName(CONST int8_t *dName,int8_t *pName)
{
	uint8_t i=0;

	for(i=0;i<8;i++)
		pName[i]=dName[i];

	pName[8]='.';

	for(i=9;i<12;i++)
		pName[i]=dName[i-1];

	i--;

	while(pName[i]==0x20)
		pName[i--]=0;

	pName[i+1]=0;i=7;

	while(pName[i--]==0x20) ;

	i+=2;

	strcpy((char *)(pName+i),(const char *)(pName+8));
}

#endif
/***********************************************************************
 - 功能描述：将字符串中的小写字符都转为大写字符
 - 隶属模块：znFAT文件系统模块
 - 函数属性：内部
 - 参数说明：str：指向待转换的字符串
 - 返回说明：无
 - 注：短文件名的情况下，文件名中的字符其实都是大写字符，为了方便，将文件
       名都转为大写
 ***********************************************************************/
#ifdef STR2UP

void Str2Up(int8_t *str)
{
	uint8_t len=strlen((const char *)str),i;

	for(i=0;i<len;i++)
	{
		str[i]=L2U(str[i]);
	}
}

#endif
/**************************************************************************
 - 功能描述：进入一个目录
 - 隶属模块：znFAT文件系统模块
 - 函数属性：外部，使用户使用
 - 参数说明：path:目录的路径 形如："\\dir1\\dir2\\" ，最后一定是以\\结束
 - 返回说明：返回目录的开始簇号，如果进入目录失败，比如目录不存在，则返回0
 - 注：此函数由后面的znFAT_Open_File等函数调用，用来实现打开任意目录下的文件
       不建议用户调用
 **************************************************************************/
#ifdef ZNFAT_ENTER_DIR

uint32_t znFAT_Enter_Dir(CONST int8_t *path)
{
	uint32_t Cur_Clust,sec_temp,iSec,iDir,Old_Clust;
	uint8_t i=1,counter=0,flag=0;
	struct znFAT_direntry *pDir;
	int8_t name[20];

	Cur_Clust=pArg->FirstDirClust;

	if(path[1]==0 && path[0]=='\\')
		return Cur_Clust;
	else
	{
		while(path[i]!=0)
		{
			if(path[i]=='\\')
			{
				for(;counter<8;counter++)
				{
					name[counter]=' ';
				}
				name[counter]=0;
				counter=0;

				do
				{
					sec_temp=(ZNFAT_SOC(Cur_Clust));
					for(iSec=sec_temp;iSec<sec_temp+pArg->SectorsPerClust;iSec++)
					{
						znFAT_ReadSector(iSec,g_au8SectorBuffer);
						for(iDir=0;iDir<pArg->BytesPerSector;iDir+=sizeof(struct znFAT_direntry))
						{
							pDir=((struct znFAT_direntry *)(g_au8SectorBuffer+iDir));
							if(Compare_Dir_Name((const int8_t *)pDir->deName,(const int8_t *)name) && (pDir->deAttributes&0x10))
							{
								flag=1;
								Cur_Clust=LE2BE(pDir->deLowCluster,2)+LE2BE(pDir->deHighClust,2)*65536;
								iDir=pArg->BytesPerSector;
								iSec=sec_temp+pArg->SectorsPerClust;
							}
						}
					}
					Old_Clust=Cur_Clust;
				}while(!flag && (Cur_Clust=znFAT_GetNextCluster(Cur_Clust))!=0x0fffffff);
				if(!flag)
				{
					g_u32TempDirCluster=Old_Clust;
					strcpy((char *)g_ai8TempDirName,(const char *)name);
					flag=0;
					return 0;
				}
				flag=0;
			}
			else
			{
				name[counter++]=(L2U(path[i]));
			}
			i++;
		}
	}
	name[counter]=0;
	flag=1;
	g_u32TempDirCluster=Cur_Clust;
	strcpy((char *)g_ai8TempDirName,(const char *)name);

