lwj19872002/C13AnalyzerBootLoader_STM32/src/common/src/znFAT.c
	return Cur_Clust;
}

#endif
/**************************************************************************
 - 功能描述：打开一个文件(支持文件名通配，如 A*.txt 或 *.*)
 - 隶属模块：znFAT文件系统模块
 - 函数属性：外部，使用户使用
 - 参数说明：pfi: znFAT_FileInfoStruct类型的结构体指针，用来装载文件的参数信息
              比如文件的大小、文件的名称、文件的开始簇等等，以备后面使用
             filepath: 文件的路径，支持任意层目录 比如
              "\\dir1\\dir2\\dir3\\....\\test.txt"
			 item：在文件名中有通配符*或?的情况下，实现与之匹配的文件并非
			 一个，item就是打开的文件的项数，比如符合通配条件的文件有6个，
			 如果item=3，那么此函数就会打开这6个文件中按顺序排号为3的那个
			 文件(item编号从0开始)
 - 返回说明：0：成功 1：文件不存在 2：目录不存在
 - 注：打开文件不成功有很多原因，比如文件不存在、文件的某一级目录不存在
       通配情况下满足条件的文件项数小于item的值等等
	   通常情况下，文件名中没有通配符，item的值我们取0就可以了
 **************************************************************************/
#ifdef ZNFAT_OPEN_FILE

uint8_t znFAT_Open_File(struct znFAT_FileInfoStruct *pfi,CONST int8_t *filepath,uint32_t item,uint8_t is_file)
{
	uint32_t Cur_Clust,sec_temp,iSec,iFile,iItem=0;
	uint8_t flag=0,i=0,h=0;
	//uint8_t index=0;
	struct znFAT_direntry *pFile;
	int8_t temp_file_name[30];

//	while(filepath[i]!=0)
//	{
//		if(filepath[i]=='\\')
//			; // index=i;
//		i++;
//	}

	Cur_Clust=znFAT_Enter_Dir(filepath);
	if(Cur_Clust)
	{
		Str2Up(g_ai8TempDirName);
		do
		{
			sec_temp=ZNFAT_SOC(Cur_Clust);
			for(iSec=sec_temp;iSec<sec_temp+pArg->SectorsPerClust;iSec++)
			{
				znFAT_ReadSector(iSec,g_au8SectorBuffer);
				for(iFile=0;iFile<pArg->BytesPerSector;iFile+=sizeof(struct znFAT_direntry))
				{
					pFile=((struct znFAT_direntry *)(g_au8SectorBuffer+iFile));
					if(pFile->deAttributes&(is_file?0x20:0x10))
					{
						znFAT_toFileName((const int8_t *)pFile->deName,temp_file_name);
						if(is_file)
						{
							i=0;
							while(g_ai8TempDirName[i]!=0)
							{
								if(g_ai8TempDirName[i++]=='.')
									h=1;
							}
							if(!h)
							{
								g_ai8TempDirName[i]='.';
								g_ai8TempDirName[i+1]=0;
							}
						}
						if(FilenameMatch(g_ai8TempDirName,temp_file_name) \
								&& (pFile->deName[0]!=0xe5) \
								&& ((pFile->deAttributes)&(is_file?0x20:0x10))) //匹配文件名
						{
							if(item==iItem)
							{
								flag=1;
								Cur_Clust=LE2BE(pFile->deLowCluster,2)+LE2BE(pFile->deHighClust,2)*65536;

								pfi->FileSize=LE2BE(pFile->deFileSize,4);
								if(pFile->deAttributes&0x10)
								temp_file_name[strlen((const char *)temp_file_name)-1]=0;

								strcpy((char *)pfi->FileName,(const char *)temp_file_name);
								pfi->FileStartCluster=LE2BE(pFile->deLowCluster,2)+LE2BE(pFile->deHighClust,2)*65536;
								pfi->FileCurCluster=pfi->FileStartCluster;
								pfi->FileCurSector=ZNFAT_SOC(pfi->FileStartCluster);
								pfi->FileCurPos=0;
								pfi->FileCurOffset=0;
								pfi->Rec_Sec=iSec;
								pfi->nRec=iFile;

								pfi->FileAttr=pFile->deAttributes;
								sec_temp=LE2BE(pFile->deCTime,2);
								(pfi->FileCreateTime).sec=(sec_temp&0x001f)*2;
								(pfi->FileCreateTime).min=((sec_temp>>5)&0x003f);
								(pfi->FileCreateTime).hour=((sec_temp>>11)&0x001f);
								sec_temp=LE2BE(pFile->deCDate,2);
								(pfi->FileCreateDate).day=((sec_temp)&0x001f);
								(pfi->FileCreateDate).month=((sec_temp>>5)&0x000f);
								(pfi->FileCreateDate).year=((sec_temp>>9)&0x007f)+1980;

								sec_temp=LE2BE(pFile->deMTime,2);
								(pfi->FileMTime).sec=(sec_temp&0x001f)*2;
								(pfi->FileMTime).min=((sec_temp>>5)&0x003f);
								(pfi->FileMTime).hour=((sec_temp>>11)&0x001f);
								sec_temp=LE2BE(pFile->deMDate,2);
								(pfi->FileMDate).day=((sec_temp)&0x001f);
								(pfi->FileMDate).month=((sec_temp>>5)&0x000f);
								(pfi->FileMDate).year=((sec_temp>>9)&0x007f)+1980;

								sec_temp=LE2BE(pFile->deADate,2);
								(pfi->FileADate).day=((sec_temp)&0x001f);
								(pfi->FileADate).month=((sec_temp>>5)&0x000f);
								(pfi->FileADate).year=((sec_temp>>9)&0x007f)+1980;

								iFile=pArg->BytesPerSector;
								iSec=sec_temp+pArg->SectorsPerClust;
							}
							else
							{
								iItem++;
							}
						}
					}
				}
			}
		}while(!flag && (Cur_Clust=znFAT_GetNextCluster(Cur_Clust))!=0x0fffffff);
		if(!flag)
		{
		return 1;
		}
		return 0;
	}
	else
	{
		return 2;
	}
}

#endif
/**************************************************************************
 - 功能描述：文件定位
 - 隶属模块：znFAT文件系统模块
 - 函数属性：外部，使用户使用
 - 参数说明：pfi:znFAT_FileInfoStruct类型的结构体指针，用于装载文件参数信息，文件
             定位后，pfi所指向的结构体中的相关参数就被更新了，比如文件的当前
             扇区，文件当前扇区中的位置，文件的当前偏移量等等，以备后面使用
             offset:要定位的偏移量，如果offset大于文件的大小，则定位到文件的
             末尾
 - 返回说明：文件定位成功返回0，否则为1
 - 注：此函数被下面的znFAT_Read_File调用，用于实现从指定位置读取数据，不建议
       用户直接调用些函数
 **************************************************************************/
#ifdef ZNFAT_SEEK_FILE

uint8_t znFAT_Seek_File(struct znFAT_FileInfoStruct *pfi,uint32_t offset)
{
	uint32_t i,temp;
	uint32_t u32Temp;

	if(offset<=pfi->FileSize)
	{
		if(offset==pfi->FileCurOffset)
		{
			pfi->FileCurPos%=pArg->BytesPerSector;
			return 1;
		}
		if(offset<pfi->FileCurOffset)
		{
			pfi->FileCurCluster=pfi->FileStartCluster;
			pfi->FileCurSector=ZNFAT_SOC(pfi->FileCurCluster);
			pfi->FileCurPos=0;
			pfi->FileCurOffset=0;
		}
		//目标偏移量与文件当前偏移量所差的字节数不小于文件在当前扇区中的位置到扇区末尾的字节数
		if((offset-pfi->FileCurOffset)>=(pArg->BytesPerSector-pfi->FileCurPos))
		{
			pfi->FileCurOffset+=(pArg->BytesPerSector-pfi->FileCurPos);
			pfi->FileCurPos=0;
			if(pfi->FileCurSector-ZNFAT_SOC(pfi->FileCurCluster)==(pArg->SectorsPerClust-1))
			{
				pfi->FileCurCluster=znFAT_GetNextCluster(pfi->FileCurCluster);
				pfi->FileCurSector=ZNFAT_SOC(pfi->FileCurCluster);
			}
			else
			{
				pfi->FileCurSector++;
			}
		}
		else
		{
			pfi->FileCurPos=(pfi->FileCurPos+offset-pfi->FileCurOffset)%pArg->BytesPerSector;
			pfi->FileCurOffset=offset;
			return 1;
		}
		temp=ZNFAT_SOC(pfi->FileCurCluster);
		if((offset-(pfi->FileCurOffset))/pArg->BytesPerSector+(pfi->FileCurSector-temp)>(pArg->SectorsPerClust-1))
		{
			pfi->FileCurOffset+=(((pArg->SectorsPerClust)-(pfi->FileCurSector-(ZNFAT_SOC(pfi->FileCurCluster))))*pArg->BytesPerSector);
			pfi->FileCurCluster=znFAT_GetNextCluster(pfi->FileCurCluster);
			pfi->FileCurSector=ZNFAT_SOC(pfi->FileCurCluster);
			pfi->FileCurPos=0;
		}
		else
		{
			pfi->FileCurSector+=(offset-pfi->FileCurOffset)/pArg->BytesPerSector;
			pfi->FileCurPos=(offset-pfi->FileCurOffset)%pArg->BytesPerSector;
			pfi->FileCurOffset=offset;
			return 1;
		}

		temp=(offset-pfi->FileCurOffset)/(pArg->BytesPerSector*pArg->SectorsPerClust);
		for(i=0;i<temp;i++)
		{
			pfi->FileCurCluster=znFAT_GetNextCluster(pfi->FileCurCluster);
		}
		pfi->FileCurOffset+=(temp*(pArg->BytesPerSector*pArg->SectorsPerClust));
		u32Temp = ZNFAT_SOC(pfi->FileCurCluster);
		pfi->FileCurSector=(u32Temp)+(offset-pfi->FileCurOffset)/pArg->BytesPerSector;
		pfi->FileCurPos=((offset-pfi->FileCurOffset))%pArg->BytesPerSector;
		pfi->FileCurOffset=offset;
	}
	else
	{
		return 1;
	}

