lwj19872002/C13AnalyzerBootLoader_STM32/src/common/src/znFAT.c
	return 0;
}

#endif
/**************************************************************************
 - 功能描述：从文件的某一个位置处，读取一定长度的数据，放入数据缓冲区中
 - 隶属模块：znFAT文件系统模块
 - 函数属性：外部，使用户使用
 - 参数说明：pfi:znFAT_FileInfoStruct类型的结构体指针，用于装载文件参数信息，文件
             读取的过程中，此结构体中的相关参数会更新，比如文件的当前偏移量、
             文件的当前扇区，文件的当前簇等等
             offset:要定位的偏移量，要小于文件的大小
             len:要读取的数据的长度，如果len+offset大于文件的大小，则实际读
             取的数据量是从offset开始到文件结束
             pbuf:数据缓冲区
 - 返回说明：读取到的实际的数据长度，如果读取失败，比如指定的偏移量大于了文件
             大小，则返回0
 - 注：在读取一个文件的数据前，必须先将该文件用znFAT_Open_File打开
 **************************************************************************/
#ifdef ZNFAT_READ_FILE

uint32_t znFAT_Read_File(struct znFAT_FileInfoStruct *pfi,uint32_t offset,uint32_t len,uint8_t *pbuf)
{
	uint32_t i,j,k,temp;
	uint32_t counter=0;

	if(offset<pfi->FileSize)
	{
		if(offset+len>pfi->FileSize) len=pfi->FileSize-offset;
		znFAT_Seek_File(pfi,offset);
//		znFAT_Seek_File(pfi,offset);

		znFAT_ReadSector(pfi->FileCurSector,g_au8SectorBuffer);
		for(i=pfi->FileCurPos;i<pArg->BytesPerSector;i++)
		{
			if(counter>=len)
			{
				return len;
			}
			pbuf[counter]=g_au8SectorBuffer[i];
			counter++;
			pfi->FileCurPos++;
			pfi->FileCurOffset++;
		}
		if(pfi->FileCurSector-(ZNFAT_SOC(pfi->FileCurCluster))!=(pArg->SectorsPerClust-1))
		{
			for(j=pfi->FileCurSector+1;j<(ZNFAT_SOC(pfi->FileCurCluster))+pArg->SectorsPerClust;j++)
			{
				znFAT_ReadSector(j,g_au8SectorBuffer);
				pfi->FileCurSector=j;
				for(i=0;i<pArg->BytesPerSector;i++)
				{
					if(counter>=len)
					{
						return len;
					}
					pbuf[counter]=g_au8SectorBuffer[i];
					counter++;
					pfi->FileCurPos++;
					pfi->FileCurOffset++;
				}
			}
		}
		temp=(len-counter)/(pArg->BytesPerSector*pArg->SectorsPerClust);
		for(k=0;k<temp;k++)
		{
		pfi->FileCurCluster=znFAT_GetNextCluster(pfi->FileCurCluster);
		for(j=(ZNFAT_SOC(pfi->FileCurCluster));j<(ZNFAT_SOC(pfi->FileCurCluster))+pArg->SectorsPerClust;j++)
		{
			znFAT_ReadSector(j,g_au8SectorBuffer);
			pfi->FileCurSector=j;
			for(i=0;i<pArg->BytesPerSector;i++)
			{
				if(counter>=len)
				{
					return len;
				}
				pbuf[counter]=g_au8SectorBuffer[i];
				counter++;
				pfi->FileCurOffset++;
				pfi->FileCurPos++;
				pfi->FileCurPos%=pArg->BytesPerSector;
			}
		}
		}
		pfi->FileCurCluster=znFAT_GetNextCluster(pfi->FileCurCluster);
		temp=(ZNFAT_SOC(pfi->FileCurCluster))+((len-counter)/pArg->BytesPerSector);
		pfi->FileCurSector=(ZNFAT_SOC(pfi->FileCurCluster));
		for(j=(ZNFAT_SOC(pfi->FileCurCluster));j<temp;j++)
		{
		znFAT_ReadSector(j,g_au8SectorBuffer);
		pfi->FileCurSector=j;
		for(i=0;i<pArg->BytesPerSector;i++)
		{
			if(counter>=len)
			{
				return len;
			}
			pbuf[counter]=g_au8SectorBuffer[i];
			counter++;
			pfi->FileCurPos++;
			pfi->FileCurPos%=pArg->BytesPerSector;
			pfi->FileCurOffset++;
		}
		}
		pfi->FileCurSector=j;
		znFAT_ReadSector(pfi->FileCurSector,g_au8SectorBuffer);
		temp=len-counter;
		for(i=0;i<temp;i++)
		{
			if(counter>=len)
			{
				return len;
			}
			pbuf[counter]=g_au8SectorBuffer[i];
			counter++;
			pfi->FileCurPos++;
			pfi->FileCurPos%=pArg->BytesPerSector;
			pfi->FileCurOffset++;
		}
	}
	else
	{
		len=0;
	}

	return len;
}

#endif
/**************************************************************************
 - 功能描述：从文件某一位置读取一定长度的数据，由pfun所指向的函数来处理
 - 隶属模块：znFAT文件系统模块
 - 函数属性：外部，使用户使用
 - 参数说明：pfi:znFAT_FileInfoStruct类型的结构体指针，用于装载文件参数信息，文件
             读取的过程中，此结构体中的相关参数会更新，比如文件的当前偏移量、
             文件的当前扇区，文件的当前簇等等
             offset:要定位的偏移量，要小于文件的大小
             len:要读取的数据的长度，如果len+offset大于文件的大小，则实际读
             取的数据量是从offset开始到文件结束
             pfun:对读取的数据的处理函数，pfun指向处理函数，这样可以灵活的
             配置数据如何去处理，比如是放在缓冲区中，还是把数据通过串口发送
             出去，只需要pfun去指向相应的处理函数可以了
 - 返回说明：读取到的实际的数据长度，如果读取失败，比如指定的偏移量大于了文件
             大小，则返回0
 - 注：在读取一个文件的数据前，必须先将该文件用znFAT_Open_File打开
 **************************************************************************/
#ifdef ZNFAT_READ_FILEX

uint32_t znFAT_Read_FileX(struct znFAT_FileInfoStruct *pfi,uint32_t offset,uint32_t len,void (*pfun)(uint8_t))
{
	uint32_t i,j,k,temp;
	uint32_t counter=0;

	if(offset<pfi->FileSize)
	{
		if(offset+len>pfi->FileSize) len=pfi->FileSize-offset;
		znFAT_Seek_File(pfi,offset);

		znFAT_ReadSector(pfi->FileCurSector,g_au8SectorBuffer);
		for(i=pfi->FileCurPos;i<pArg->BytesPerSector;i++)
		{
			if(counter>=len)
			{
				return len;
			}
			(*pfun)(g_au8SectorBuffer[i]);
			counter++;
			pfi->FileCurPos++;
			pfi->FileCurOffset++;
		}
		if(pfi->FileCurSector-(ZNFAT_SOC(pfi->FileCurCluster))!=(pArg->SectorsPerClust-1))
		{
			for(j=pfi->FileCurSector+1;j<(ZNFAT_SOC(pfi->FileCurCluster))+pArg->SectorsPerClust;j++)
			{
				znFAT_ReadSector(j,g_au8SectorBuffer);
				pfi->FileCurSector=j;
				for(i=0;i<pArg->BytesPerSector;i++)
				{
					if(counter>=len)
					{
						return len;
					}
					(*pfun)(g_au8SectorBuffer[i]);
					counter++;
					pfi->FileCurPos++;
					pfi->FileCurOffset++;
				}
			}
		}
		temp=(len-counter)/(pArg->BytesPerSector*pArg->SectorsPerClust);
		for(k=0;k<temp;k++)
		{
			pfi->FileCurCluster=znFAT_GetNextCluster(pfi->FileCurCluster);
			for(j=(ZNFAT_SOC(pfi->FileCurCluster));j<(ZNFAT_SOC(pfi->FileCurCluster))+pArg->SectorsPerClust;j++)
			{
				znFAT_ReadSector(j,g_au8SectorBuffer);
				pfi->FileCurSector=j;
				for(i=0;i<pArg->BytesPerSector;i++)
				{
					if(counter>=len)
					{
						return len;
					}
					(*pfun)(g_au8SectorBuffer[i]);
					counter++;
					pfi->FileCurOffset++;
					pfi->FileCurPos++;
					pfi->FileCurPos%=pArg->BytesPerSector;
				}
			}
		}
		pfi->FileCurCluster=znFAT_GetNextCluster(pfi->FileCurCluster);
		temp=(ZNFAT_SOC(pfi->FileCurCluster))+((len-counter)/pArg->BytesPerSector);
		pfi->FileCurSector=(ZNFAT_SOC(pfi->FileCurCluster));
		for(j=(ZNFAT_SOC(pfi->FileCurCluster));j<temp;j++)
		{
			znFAT_ReadSector(j,g_au8SectorBuffer);
			pfi->FileCurSector=j;
			for(i=0;i<pArg->BytesPerSector;i++)
			{
				if(counter>=len)
				{
					return len;
				}
				(*pfun)(g_au8SectorBuffer[i]);
				counter++;
				pfi->FileCurPos++;
				pfi->FileCurPos%=pArg->BytesPerSector;
				pfi->FileCurOffset++;
			}
		}
		pfi->FileCurSector=j;
		znFAT_ReadSector(pfi->FileCurSector,g_au8SectorBuffer);
		temp=len-counter;
		for(i=0;i<temp;i++)
		{
			if(counter>=len)
			{
				return len;
			}
			(*pfun)(g_au8SectorBuffer[i]);
			counter++;
			pfi->FileCurPos++;
			pfi->FileCurPos%=pArg->BytesPerSector;
			pfi->FileCurOffset++;
		}
	}
	else
	{
		len=0;
	}

	return len;
}

#endif
/**************************************************************************
 - 功能描述：寻找可用的空闲簇
 - 隶属模块：znFAT文件系统模块
 - 函数属性：内部
 - 参数说明：无
 - 返回说明：如果找到了空闲簇，返回空闲簇的簇号，否则返回0
 - 注：寻找空闲簇是创建目录/文件以及向文件写入数据的基础，它如果能很快的寻
       找到空闲簇，那么创建目录/文件以及向文件写入数据这些操作也会比较快。
       所以我们绝不会从最开始的簇依次去寻找，而是使用了二分搜索的算法，以达
       到较好的效果。如果空闲簇没有找到，很有可能就说明存储设备已经没有空间
       了
 **************************************************************************/
#ifdef ZNFAT_FIND_FREE_CLUST

uint32_t znFAT_Find_Free_Clust(uint8_t flag)
{
	uint32_t iClu,iSec;
	struct znFAT_FAT *pFAT;
	for(iSec=pArg->FirstFATSector+g_u32TempLastCluster/128;iSec<pArg->FirstFATSector+pArg->FATsectors;iSec++)
	{
		znFAT_ReadSector(iSec,g_au8SectorBuffer);
		pFAT=(struct znFAT_FAT *)g_au8SectorBuffer;
		for(iClu=0;iClu<pArg->BytesPerSector/4;iClu++)
		{
			if(LE2BE((uint8_t *)(&((pFAT->Items))[iClu]),4)==0)
			{
				if(!flag)
				{
					znFAT_Update_FSInfo_Free_Clu(0);
					g_u32TempLastCluster=128*(iSec-pArg->FirstFATSector)+iClu;
					znFAT_Empty_Cluster(g_u32TempLastCluster);
					return g_u32TempLastCluster;
				}
				else
				{
					znFAT_Update_FSInfo_Last_Clu(128*(iSec-pArg->FirstFATSector)+iClu);
					return 128*(iSec-pArg->FirstFATSector)+iClu;
				}
			}
		}
	}
	return 0;
}

#endif
/**************************************************************************
 - 功能描述：填充文件/目录项
 - 隶属模块：znFAT文件系统模块
 - 函数属性：内部
 - 参数说明：prec:指向一个znFAT_direntry类型的结构体，它的结构就是znFAT中文件/
             目录项的结构
             name:文件或目录的名称
             is_dir:指示这个文件/目录项是文件还是目录，分别用来实现文件、
             目录的创建 1表示创建目录 0表示创建文件
 - 返回说明：无
 - 注：这里创建文件或目录的方法是，先将文件或目录的信息填充到一个结构体中，
       然后再将这个结构体的数据写入到存储设备的相应的扇区的相应位置上去，这
       样就完成了文件或目录的创建。
       在填充文件或目录的信息时，文件或目录的首簇并没有填进去，而是全0
 **************************************************************************/
#ifdef FILL_REC_INF

