lwj19872002/C13AnalyzerBootLoader_STM32/src/common/src/znFAT.c
void Fill_Rec_Inf(struct znFAT_direntry *prec,int8_t *name,uint8_t is_dir,uint8_t *ptd)
{
	uint8_t i=0,len=0,h=0;
	uint16_t temp;

	if(is_dir)
	{
		len=strlen((const char *)name);
		if(len>8)
		{
			for(i=0;i<6;i++)
			{
				(prec->deName)[i]=L2U(name[i]);
			}
			(prec->deName)[6]='~';
			(prec->deName)[7]='1';
		}
		else
		{
			for(i=0;i<len;i++)
			{
				(prec->deName)[i]=L2U(name[i]);
			}
			for(;i<8;i++)
			{
				(prec->deName)[i]=' ';
			}
		}
		for(i=0;i<3;i++)
		{
			(prec->deExtension)[i]=' ';
		}
	}
	else
	{
		while(name[len]!=0)
		{
			if(name[len]=='.')
				h=1;
			len++;
		}

		if(!h)
		{
			name[len]='.';
			name[len+1]=0;
		}

		len=0;
		while(name[len]!='.' && name[len]!=0)
			len++;

		if(len>8)
		{
			for(i=0;i<6;i++)
			{
				(prec->deName)[i]=L2U(name[i]);
			}
			(prec->deName)[6]='~';
			(prec->deName)[7]='1';
		}
		else
		{
			for(i=0;i<len;i++)
			{
				(prec->deName)[i]=L2U(name[i]);
			}
			for(;i<8;i++)
			{
				(prec->deName)[i]=' ';
			}
		}
		if(name[len]==0)
		{
			for(i=0;i<3;i++)
			{
				(prec->deExtension)[i]=' ';
			}
		}
		else
		{
			for(i=0;i<3;i++)
			{
				(prec->deExtension)[i]=' ';
			}
			len++;
			i=0;
			while(name[len]!=0)
			{
				(prec->deExtension)[i++]=L2U(name[len]);
				len++;
			}
		}
	}
	if(is_dir)
		(prec->deAttributes)=0x10;
	else
		(prec->deAttributes)=0x20;

	temp=ZNFAT_MAKE_FILE_TIME(ptd[3],ptd[4],ptd[5]);
	(prec->deCTime)[0]=temp;
	(prec->deCTime)[1]=temp>>8;
	temp=ZNFAT_MAKE_FILE_DATE(ptd[0],ptd[1],ptd[2]);
	(prec->deCDate)[0]=temp;
	(prec->deCDate)[1]=temp>>8;

	(prec->deLowerCase)=0;
	(prec->deHighClust)[0]=0;
	(prec->deHighClust)[1]=0;
	(prec->deLowCluster)[0]=0;
	(prec->deLowCluster)[1]=0;

	for(i=0;i<4;i++)
	{
		(prec->deFileSize)[i]=0;
	}
}

#endif
/**************************************************************************
 - 功能描述：更新FAT表
 - 隶属模块：znFAT文件系统模块
 - 函数属性：内部
 - 参数说明：cluster:要更新的簇项号
             dat:要将相应的簇项更新为dat
 - 返回说明：无
 - 注：在向文件写入了数据后，需要对FAT表进行更表，以表明新数据的簇链关系
       删除文件的时候，也需要将该文件的簇项进行清除，销毁文件的簇链关系
 **************************************************************************/
#ifdef ZNFAT_MODIFY_FAT

void znFAT_Modify_FAT(uint32_t cluster,uint32_t dat)
{
	znFAT_ReadSector(pArg->FirstFATSector+(cluster*4/pArg->BytesPerSector),g_au8SectorBuffer);
	g_au8SectorBuffer[((cluster*4)%pArg->BytesPerSector)+0]=dat&0x000000ff;
	g_au8SectorBuffer[((cluster*4)%pArg->BytesPerSector)+1]=(dat&0x0000ff00)>>8;
	g_au8SectorBuffer[((cluster*4)%pArg->BytesPerSector)+2]=(dat&0x00ff0000)>>16;
	g_au8SectorBuffer[((cluster*4)%pArg->BytesPerSector)+3]=(dat&0xff000000)>>24;
	znFAT_WriteSector(pArg->FirstFATSector+(cluster*4/pArg->BytesPerSector),g_au8SectorBuffer);

	znFAT_ReadSector(pArg->FirstFATSector+pArg->FATsectors+(cluster*4/pArg->BytesPerSector),g_au8SectorBuffer);
	g_au8SectorBuffer[((cluster*4)%pArg->BytesPerSector)+0]=dat&0x000000ff;
	g_au8SectorBuffer[((cluster*4)%pArg->BytesPerSector)+1]=(dat&0x0000ff00)>>8;
	g_au8SectorBuffer[((cluster*4)%pArg->BytesPerSector)+2]=(dat&0x00ff0000)>>16;
	g_au8SectorBuffer[((cluster*4)%pArg->BytesPerSector)+3]=(dat&0xff000000)>>24;
	znFAT_WriteSector(pArg->FirstFATSector+pArg->FATsectors+(cluster*4/pArg->BytesPerSector),g_au8SectorBuffer);
}

#endif

/**************************************************************************
 - 功能描述：在存储设备中创建一个文件/目录项
 - 隶属模块：znFAT文件系统模块
 - 函数属性：内部
 - 参数说明：pfi:指向znFAT_FileInfoStruct类型的结构体，用于装载刚创建的文件的信息
                 也就是说，如果创建的是目录，则此结构体不会被更新
             cluster:在cluster这个簇中创建文件/目录项，用于实现在任意目录下
                 创建文件或目录，可以通过znFAT_Enter_Dir来获取某一个目录的开
                 始簇
             name:文件/目录的名称
             is_dir:指示要创建的是文件还是目录，文件与目录的创建方法是不同的
                 1表示创建目录 0表示创建文件
 - 返回说明：成功返回1，失败返回-1
 **************************************************************************/
#ifdef ZNFAT_CREATE_REC

uint8_t znFAT_Create_Rec(struct znFAT_FileInfoStruct *pfi,uint32_t cluster,int8_t *name,uint8_t is_dir,uint8_t *ptd)
{
	uint32_t iSec,iRec,temp_sec,temp_clu,new_clu,i,old_clu;
	uint8_t flag=0;
	uint16_t temp_Rec;
	struct znFAT_direntry *pRec;

	Fill_Rec_Inf(&g_stTempRec,name,is_dir,ptd);

	do
	{
		old_clu=cluster;
		temp_sec=ZNFAT_SOC(cluster);
		for(iSec=temp_sec;iSec<temp_sec+pArg->SectorsPerClust;iSec++)
		{
			znFAT_ReadSector(iSec,g_au8SectorBuffer);
			for(iRec=0;iRec<pArg->BytesPerSector;iRec+=sizeof(struct znFAT_direntry))
			{
				pRec=(struct znFAT_direntry *)(g_au8SectorBuffer+iRec);
				if((pRec->deName)[0]==0)
				{
					flag=1;
					if(is_dir)
					{
						if(!(new_clu=znFAT_Find_Free_Clust(0))) return -1;
						znFAT_Modify_FAT(new_clu,0x0fffffff);
						(g_stTempRec.deHighClust)[0]=(new_clu&0x00ff0000)>>16;
						(g_stTempRec.deHighClust)[1]=(new_clu&0xff000000)>>24;
						(g_stTempRec.deLowCluster)[0]=(new_clu&0x000000ff);
						(g_stTempRec.deLowCluster)[1]=(new_clu&0x0000ff00)>>8;
					}
					znFAT_ReadSector(iSec,g_au8SectorBuffer);
					for(i=0;i<sizeof(struct znFAT_direntry);i++)
					{
						((uint8_t *)pRec)[i]=((uint8_t *)(&g_stTempRec))[i];
					}
					znFAT_WriteSector(iSec,g_au8SectorBuffer);
					temp_sec=iSec;
					temp_Rec=iRec;
					iRec=pArg->BytesPerSector;
					iSec=temp_sec+pArg->SectorsPerClust;
				}
			}
		}
	}while(!flag && (cluster=znFAT_GetNextCluster(cluster))!=0x0fffffff);

	if(!flag)
	{
		if(!(temp_clu=znFAT_Find_Free_Clust(0))) return -1;

		znFAT_Modify_FAT(temp_clu,0x0fffffff);
		znFAT_Modify_FAT(old_clu,temp_clu);
		temp_sec=ZNFAT_SOC(temp_clu);
		temp_Rec=0;
		znFAT_ReadSector(temp_sec,g_au8SectorBuffer);
		if(is_dir)
		{
			if(!(new_clu=znFAT_Find_Free_Clust(0))) return -1;

			znFAT_Modify_FAT(new_clu,0x0fffffff);
			znFAT_ReadSector(temp_sec,g_au8SectorBuffer);
			(g_stTempRec.deHighClust)[0]=(new_clu&0x00ff0000)>>16;
			(g_stTempRec.deHighClust)[1]=(new_clu&0xff000000)>>24;
			(g_stTempRec.deLowCluster)[0]=(new_clu&0x000000ff);
			(g_stTempRec.deLowCluster)[1]=(new_clu&0x0000ff00)>>8;
		}
		for(i=0;i<sizeof(struct znFAT_direntry);i++)
		{
			g_au8SectorBuffer[i]=((uint8_t *)(&g_stTempRec))[i];
		}
		znFAT_WriteSector(temp_sec,g_au8SectorBuffer);
	}
	if(is_dir)
	{
		znFAT_Empty_Cluster(new_clu);

		Fill_Rec_Inf(&g_stTempRec,".",1,ptd);
		(g_stTempRec.deHighClust)[0]=(new_clu&0x00ff0000)>>16;
		(g_stTempRec.deHighClust)[1]=(new_clu&0xff000000)>>24;
		(g_stTempRec.deLowCluster)[0]=(new_clu&0x000000ff);
		(g_stTempRec.deLowCluster)[1]=(new_clu&0x0000ff00)>>8;
		for(i=0;i<sizeof(struct znFAT_direntry);i++)
		{
			g_au8SectorBuffer[i]=((uint8_t *)(&g_stTempRec))[i];
		}
		Fill_Rec_Inf(&g_stTempRec,"..",1,ptd);
		if(cluster==pArg->FirstDirClust)
		{
			(g_stTempRec.deHighClust)[0]=0;
			(g_stTempRec.deHighClust)[1]=0;
			(g_stTempRec.deLowCluster)[0]=0;
			(g_stTempRec.deLowCluster)[1]=0;
		}
		else
		{
			(g_stTempRec.deHighClust)[0]=(cluster&0x00ff0000)>>16;
			(g_stTempRec.deHighClust)[1]=(cluster&0xff000000)>>24;
			(g_stTempRec.deLowCluster)[0]=(cluster&0x000000ff);
			(g_stTempRec.deLowCluster)[1]=(cluster&0x0000ff00)>>8;
		}

		for(i=sizeof(struct znFAT_direntry);i<2*sizeof(struct znFAT_direntry);i++)
		{
			g_au8SectorBuffer[i]=((uint8_t *)(&g_stTempRec))[i-sizeof(struct znFAT_direntry)];
		}
		for(;i<pArg->BytesPerSector;i++)
		{
			g_au8SectorBuffer[i]=0;
		}
		temp_sec=ZNFAT_SOC(new_clu);
		znFAT_WriteSector(temp_sec,g_au8SectorBuffer);
	}
	else
	{
		strcpy((char *)pfi->FileName,(const char *)name);
		pfi->FileStartCluster=0;
		pfi->FileCurCluster=0;
		pfi->FileSize=0;
		pfi->FileCurSector=0;
		pfi->FileCurPos=0;
		pfi->FileCurOffset=0;
		pfi->Rec_Sec=temp_sec;
		pfi->nRec=temp_Rec;

