lwj19872002/C13AnalyzerBootLoader_STM32/src/common/src/znFAT.c
		pfi->FileAttr=g_stTempRec.deAttributes;
	}

	znFAT_Find_Free_Clust(1);

	return 1;
}

#endif
/**************************************************************************
 - 功能描述：向某一个文件追加数据
 - 隶属模块：znFAT文件系统模块
 - 函数属性：外部，使用户使用
 - 参数说明：pfi:指向znFAT_FileInfoStruct类型的结构体，用于装载刚创建的文件的信息
             len:要追加的数据长度
             pbuf:指向数据缓冲区的指针
 - 返回说明：成功返回实际写入的数据长度，失败返回0
 - 注：追加数据失败很有可能是存储设备已经没有空间了，也就是找不到空闲簇了
 **************************************************************************/
#ifdef ZNFAT_ADD_DAT

uint32_t znFAT_Add_Dat(struct znFAT_FileInfoStruct *pfi,uint32_t len,uint8_t *pbuf)
{
	uint32_t i=0,counter=0,iSec,iClu;
	uint32_t temp_sub,temp_file_size,new_clu,temp_sec;
	struct znFAT_direntry *prec;
	if(len>0)
	{
		znFAT_ReadSector(pfi->Rec_Sec,g_au8SectorBuffer);
		prec=(struct znFAT_direntry *)(g_au8SectorBuffer+pfi->nRec);
		temp_file_size=LE2BE((prec->deFileSize),4);
		if(!temp_file_size)
		{
			if(!(new_clu=znFAT_Find_Free_Clust(0))) return 0;
			znFAT_Modify_FAT(new_clu,0x0fffffff);
			pfi->FileStartCluster=new_clu;
			pfi->FileCurCluster=pfi->FileStartCluster;
			pfi->FileSize=0;
			pfi->FileCurSector=ZNFAT_SOC(pfi->FileCurCluster);
			pfi->FileCurPos=0;
			pfi->FileCurOffset=0;
			znFAT_ReadSector(pfi->Rec_Sec,g_au8SectorBuffer);
			(prec->deHighClust)[0]=(new_clu&0x00ff0000)>>16;
			(prec->deHighClust)[1]=(new_clu&0xff000000)>>24;
			(prec->deLowCluster)[0]=(new_clu&0x000000ff);
			(prec->deLowCluster)[1]=(new_clu&0x0000ff00)>>8;
			znFAT_WriteSector(pfi->Rec_Sec,g_au8SectorBuffer);
		}
		else
		{
			if(!(temp_file_size%(pArg->SectorsPerClust*pArg->BytesPerSector))) //在簇的最末尾临界地方，需要寻找新簇
			{
				znFAT_Seek_File(pfi,pfi->FileSize-1);
				if(!(new_clu=znFAT_Find_Free_Clust(0))) return 0;
				znFAT_Modify_FAT(pfi->FileCurCluster,new_clu);
				znFAT_Modify_FAT(new_clu,0x0fffffff);
			}
			znFAT_Seek_File(pfi,pfi->FileSize);
		}

		iSec=pfi->FileCurSector;

		znFAT_ReadSector(iSec,g_au8SectorBuffer);
		for(i=pfi->FileCurPos;i<pArg->BytesPerSector;i++)
		{
			g_au8SectorBuffer[i]=pbuf[counter];
			counter++;
			if(counter>=len)
			{
				iSec=pfi->FileCurSector;
				goto end;
			}
		}
		znFAT_WriteSector(pfi->FileCurSector,g_au8SectorBuffer); //数据接缝

		if(pfi->FileCurSector-(ZNFAT_SOC(pfi->FileCurCluster))<(pArg->SectorsPerClust-1)) //判断是不是一个簇的最后一个扇区,先将当前簇所有扇区填满
		{
			for(iSec=pfi->FileCurSector+1;iSec<=(ZNFAT_SOC(pfi->FileCurCluster)+pArg->SectorsPerClust-1);iSec++)
			{
				for(i=0;i<pArg->BytesPerSector;i++)
				{
					g_au8SectorBuffer[i]=pbuf[counter];
					counter++;
					if(counter>=len)
					{
						goto end;
					}
				}
				znFAT_WriteSector(iSec,g_au8SectorBuffer);
			}
		}

		temp_sub=len-counter;
		for(iClu=0;iClu<temp_sub/(pArg->SectorsPerClust*pArg->BytesPerSector);iClu++)
		{
			if(!(new_clu=znFAT_Find_Free_Clust(0))) return 0;
			znFAT_Modify_FAT(pfi->FileCurCluster,new_clu);
			znFAT_Modify_FAT(new_clu,0x0fffffff);
			pfi->FileCurCluster=new_clu;

			temp_sec=ZNFAT_SOC(new_clu);
			for(iSec=temp_sec;iSec<temp_sec+pArg->SectorsPerClust;iSec++)
			{
				for(i=0;i<pArg->BytesPerSector;i++)
				{
					g_au8SectorBuffer[i]=pbuf[counter];
					counter++;
				}
				znFAT_WriteSector(iSec,g_au8SectorBuffer);
			}
		}

		temp_sub=len-counter;
		if(temp_sub)
		{
			if(!(new_clu=znFAT_Find_Free_Clust(0))) return 0;
			znFAT_Modify_FAT(pfi->FileCurCluster,new_clu);
			znFAT_Modify_FAT(new_clu,0x0fffffff);
			pfi->FileCurCluster=new_clu;
			temp_sec=ZNFAT_SOC(new_clu);
			for(iSec=temp_sec;iSec<temp_sec+temp_sub/pArg->BytesPerSector;iSec++)
			{
				for(i=0;i<pArg->BytesPerSector;i++)
				{
					g_au8SectorBuffer[i]=pbuf[counter];
					counter++;
				}
				znFAT_WriteSector(iSec,g_au8SectorBuffer);
			}
		}

		temp_sub=len-counter;
		if(temp_sub)
		{
			for(i=0;i<pArg->BytesPerSector;i++)
			{
				g_au8SectorBuffer[i]=pbuf[counter];
				counter++;
			}
			znFAT_WriteSector(iSec,g_au8SectorBuffer);
		}

	end:
		znFAT_WriteSector(iSec,g_au8SectorBuffer);
		znFAT_ReadSector(pfi->Rec_Sec,g_au8SectorBuffer);
		(((struct znFAT_direntry *)(g_au8SectorBuffer+pfi->nRec))->deFileSize)[0]=((temp_file_size+len)&0x000000ff);
		(((struct znFAT_direntry *)(g_au8SectorBuffer+pfi->nRec))->deFileSize)[1]=((temp_file_size+len)&0x0000ff00)>>8;
		(((struct znFAT_direntry *)(g_au8SectorBuffer+pfi->nRec))->deFileSize)[2]=((temp_file_size+len)&0x00ff0000)>>16;
		(((struct znFAT_direntry *)(g_au8SectorBuffer+pfi->nRec))->deFileSize)[3]=((temp_file_size+len)&0xff000000)>>24;
		znFAT_WriteSector(pfi->Rec_Sec,g_au8SectorBuffer);

		pfi->FileSize=(temp_file_size+len);
		pfi->FileCurSector=(pfi->FileSize%pArg->BytesPerSector)?iSec:iSec+1;
		pfi->FileCurPos=pfi->FileSize%pArg->BytesPerSector;
		pfi->FileCurOffset=pfi->FileSize;
	}

	znFAT_Find_Free_Clust(1);

	return len;
}

#endif
/**************************************************************************
 - 功能描述：创建目录(支持任意层目录创建)
 - 隶属模块：znFAT文件系统模块
 - 函数属性：外部，使用户使用
 - 参数说明：pfi:无用
             dirpath:目录路径 比如 "\\dir1\\dir2\\dir3\\....\\dirn\\"
             最后必须是\\结束
 - 返回说明：成功返回0，失败返回1
 - 注：如果中间某一级目录不存在，比如上面的这个路径中dir3不存在，那么此函数会
       创建这个目录，然后再继续去创建更深层的目录
       创建目录失败有可能是因为存储设备空间不足
 **************************************************************************/
#ifdef ZNFAT_CREATE_DIR

uint8_t znFAT_Create_Dir(CONST int8_t *dirpath,uint8_t *ptd)
{
	struct znFAT_FileInfoStruct *pfi;

	while(!znFAT_Enter_Dir(dirpath))
	{
		if(znFAT_Create_Rec(pfi,g_u32TempDirCluster,g_ai8TempDirName,1,ptd)==1)
		{
			return 1;
		}
	}

	return 0;
}

#endif
/**************************************************************************
 - 功能描述：创建文件(支持任意层目录创建)
 - 隶属模块：znFAT文件系统模块
 - 函数属性：外部，使用户使用
 - 参数说明：pfi:一个指向znFAT_FileInfoStruct类型的结构体的指针，用来装载新创建的
             文件信息，因此新创建的文件不用再打开就可以直接来操作
             filepath:文件路径 比如 "\\dir1\\dir2\\dir3\\....\\dirn\\test.txt"
 - 返回说明：0：成功 1：文件已存在 2：创建文件目录失败 3：创建文件失败
 - 注：如果文件路径中某一个中间目录不存在，那么此函数会创建这个目录，再继续
       去创建更深层的目录，一直到最后把文件创建完成。
       创建文件失败有可能是因为存储设备空间不足，或是此文件已经存在
 **************************************************************************/
#ifdef ZNFAT_CREATE_FILE

