lwj19872002/C13AnalyzerBootLoader_STM32/src/common/src/znFAT.c
uint8_t znFAT_Create_File(struct znFAT_FileInfoStruct *pfi,CONST int8_t *filepath,uint8_t *ptd)
{
	if(znFAT_Open_File(pfi,filepath,0,1))
	{
		if(!znFAT_Create_Dir(filepath,ptd))
		{
			if(znFAT_Create_Rec(pfi,g_u32TempDirCluster,g_ai8TempDirName,0,ptd)==1)
			{
				return 3;
			}
		}
		else
		{
			return 2;
		}
	}
	else
	{
		return 1;
	}
	return 0;
}

#endif
/**************************************************************************
 - 功能描述：删除文件(支持任意层目录)
 - 隶属模块：znFAT文件系统模块
 - 函数属性：外部，使用户使用
 - 参数说明：filepath:文件路径 比如 "\\dir1\\dir2\\dir3\\....\\dirn\\test.txt"
 - 返回说明：1:文件或目录路径不存在 0:成功
 - 注：删除后的文件的FAT表中的簇链关系完全被破坏
 **************************************************************************/
#ifdef ZNFAT_DEL_FILE

uint8_t znFAT_Del_File(CONST int8_t *filepath)
{
	uint32_t cur_clu,next_clu;
	struct znFAT_FileInfoStruct fi;

	if(znFAT_Open_File(&fi,filepath,0,1))
	{
		return 1;
	}
	znFAT_ReadSector(fi.Rec_Sec,g_au8SectorBuffer);
	*(g_au8SectorBuffer+fi.nRec)=0xe5;
	znFAT_WriteSector(fi.Rec_Sec,g_au8SectorBuffer);

	cur_clu=fi.FileStartCluster;
	if(cur_clu)
	{
		if(cur_clu<Search_Last_Usable_Cluster())
		znFAT_Update_FSInfo_Last_Clu(cur_clu);
		znFAT_Update_FSInfo_Free_Clu(1);
		next_clu=znFAT_GetNextCluster(cur_clu);
		while(next_clu!=0x0fffffff)
		{
			znFAT_Update_FSInfo_Free_Clu(1);
			znFAT_Modify_FAT(cur_clu,0x00000000);
			cur_clu=next_clu;
			next_clu=znFAT_GetNextCluster(cur_clu);
		}
		znFAT_Modify_FAT(cur_clu,0x00000000);
	}
	return 0;
}

#endif
/**************************************************************************
 - 功能描述：文件拷贝(源文件路径与目标文件路径均支持任意深层目录，并且支持
             文件名通配)
 - 隶属模块：znFAT文件系统模块
 - 函数属性：外部，使用户使用
 - 参数说明：pArg1:是源文件所在的存储设备的初始参数结构体的指针
			pArg2:是目标文件所在的存储设备的初始参数结构体的指针
			sfilename:源文件路径，也就是拷贝操作的数据源
			tfilename:目标文件路径，也就是数据最终到写入的文件
			比如 "\\dir1\\dir2\\dir3\\....\\dirn\\test.txt"
			file_buf:拷贝过程中要用到的数据缓冲区，此缓冲区容量越大，
			拷贝速度越快
			buf_size:数据缓冲区的大小
 - 返回说明：1:目录文件创建失败 2:源文件打开打败 0:成功
 - 注：此函数支持多设备之间的文件拷贝，pArg1与pArg2引入了源存储设备与目的
       存储设备的初始参数信息，从而可以同时对两个存储设备进行操作。
	   znFAT 5.01版开始支持多设备，多设备间的相互数据拷贝是最典型的应用
 **************************************************************************/
#ifdef ZNFAT_XCOPY_FILE

uint8_t znFAT_XCopy_File(struct znFAT_Init_Arg *pArg1,struct znFAT_Init_Arg *pArg2,CONST int8_t *sfilename,CONST int8_t *tfilename,uint8_t *file_buf,uint32_t buf_size,uint8_t *pt)
{
	struct znFAT_FileInfoStruct FileInfo2,FileInfo1;
	struct znFAT_Init_Arg *pArg_temp;
	uint32_t i;

	pArg_temp=pArg; //把pArg原来的指向赋给中间变量

	pArg=pArg2;g_u8DeviceNo=pArg->DEV_No; //标定目标存储设备
	if(znFAT_Create_File(&FileInfo1,tfilename,pt)) return 1; //在目标存储设备上创建目标文件

	pArg=pArg1;g_u8DeviceNo=pArg->DEV_No; //标定源存储设备
	if(znFAT_Open_File(&FileInfo2,sfilename,0,1)) return 2;  //在源存储设备上打开源文件

	for(i=0;i<FileInfo2.FileSize/buf_size;i++)
	{
		pArg=pArg1;g_u8DeviceNo=pArg->DEV_No; //标定源存储设备
		znFAT_Read_File(&FileInfo2,i*buf_size,buf_size,file_buf);	//读源存储设备上的源文件数据到数据缓冲区

		pArg=pArg2;g_u8DeviceNo=pArg->DEV_No;	//标定目标存储设备
		znFAT_Add_Dat(&FileInfo1,buf_size,file_buf); //将数据级冲区的数据写入到目标文件中
	}

	pArg=pArg1;g_u8DeviceNo=pArg->DEV_No; //标定源存储设备
	znFAT_Read_File(&FileInfo2,i*buf_size,FileInfo2.FileSize%buf_size,file_buf);//读取最后的文件余量

	pArg=pArg2;g_u8DeviceNo=pArg->DEV_No; //标定目标存储设备
	znFAT_Add_Dat(&FileInfo1,FileInfo2.FileSize%buf_size,file_buf); //将最后的余量数据写入到目标文件中

	pArg=pArg_temp; //将pArg恢复

	return 0;
}

#endif
/**************************************************************************
 - 功能描述：文件重命名
 - 隶属模块：znFAT文件系统模块
 - 函数属性：外部，使用户使用
 - 参数说明：filename:将要重命名的源文件的路径 如\a.txt
             newfilename:目标文件名 如b.txt (注目标文件名是单纯的文件名，
			 不含路径)
 - 返回说明：1:源文件打开打败 0:成功
 - 注：无
 **************************************************************************/
#ifdef ZNFAT_RENAME_FILE

uint8_t znFAT_Rename_File(CONST int8_t *filename,CONST int8_t *newfilename)
{
	struct znFAT_FileInfoStruct fi;
	uint8_t i=0,j=0;

	if(znFAT_Open_File(&fi,filename,0,1))
		return 1; //文件打开失败

	znFAT_ReadSector(fi.Rec_Sec,g_au8SectorBuffer);

	for(i=0;i<11;i++)
		(g_au8SectorBuffer+fi.nRec)[i]=0x20;

	i=0;
	while(newfilename[i]!='.')
	{
		(g_au8SectorBuffer+fi.nRec)[i]=L2U(newfilename[i]);
		i++;
	}

	i++;
	while(newfilename[i])
	{
		(g_au8SectorBuffer+fi.nRec+8)[j]=L2U(newfilename[i]);
		i++;j++;
	}

	znFAT_WriteSector(fi.Rec_Sec,g_au8SectorBuffer);
	return 0;
}

#endif
/**************************************************************************
 - 功能描述：文件关闭
 - 隶属模块：znFAT文件系统模块
 - 函数属性：外部，使用户使用
 - 参数说明：pfi:指向当前打开的文件的文件信息结构
 - 返回说明：0:成功
 - 注：无
 **************************************************************************/
#ifdef ZNFAT_FILE_CLOSE

uint8_t znFAT_File_Close(struct znFAT_FileInfoStruct *pfi)
{
	uint16_t i=0;

	for(i=0;i<sizeof(struct znFAT_FileInfoStruct);i++)
	{
		((uint8_t *)pfi)[i]=0;
	}

	return 0;
}

#endif
